[
  {
    "id": 4944,
    "name": "Acorn Archimedes",
    "alias": "acorn-archimedes",
    "icon": "acorn-archimedes-1446690349.png",
    "console": "4944.png",
    "controller": null,
    "developer": "Acorn Computers",
    "manufacturer": "Acorn Computers",
    "media": null,
    "cpu": "Acorn RISC Machine",
    "memory": "512 KB ~ 16 MB",
    "graphics": null,
    "sound": null,
    "maxcontrollers": null,
    "display": null,
    "overview": "The Acorn Archimedes is a family of personal computers designed by Acorn Computers Ltd in Cambridge, England and sold in the late-1980s to mid-1990s, their first general purpose home computer based on their own ARM architecture. The Archimedes was one of the most powerful home computers available during the late 1980s and early 1990s; its main CPU was faster than the Motorola 68000 microprocessors found in the more popular Commodore Amiga and Atari ST machines.",
    "youtube": null,
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/boxart/4944-1.jpg",
    "emulators": []
  },
  {
    "id": "4911",
    "name": "Amiga",
    "iconUrl": "https://picsum.photos/seed/amiga/40/40",
    "emulators": [
      {
        "id": "uae-emu",
        "name": "WinUAE",
        "executablePath": "C:\\Program Files\\WinUAE\\winuae.exe",
        "args": "-f {CONFIG} {ROM}"
      },
      {
        "id": "fs-uae-emu",
        "name": "FS-UAE",
        "executablePath": "/usr/bin/fs-uae",
        "args": "--fullscreen {ROM}"
      }
    ]
  },
  {
    "id": 4911,
    "name": "Amiga",
    "alias": "amiga",
    "icon": "amiga-1336524133.png",
    "console": "4911.png",
    "controller": null,
    "developer": "Commodore",
    "manufacturer": "Commodore",
    "media": "Disk",
    "cpu": "Motorola 68000",
    "memory": "16MB",
    "graphics": "AGA chipset",
    "sound": "The sound chip, named Paula, supports four sound channels (two for the left speaker and two for the right) with 8-bit resolution for each channel and a 6-bit volume control per channel.",
    "maxcontrollers": "1",
    "display": "1024×800 for NTSC and 1024×1024 for PAL",
    "overview": "The Amiga is a family of personal computers marketed by Commodore in the 1980s and 1990s. The first model was launched in 1985 as a high-end home computer and became popular for its graphical, audio and multi-tasking abilities. The Amiga provided a significant upgrade from 8-bit computers, such as the Commodore 64, and the platform quickly grew in popularity among computer enthusiasts. The best selling model, the Amiga 500, was introduced in 1987 and became the leading home computer of the late 1980s and early 1990s in much of Western Europe. In North America success was more modest. The Amiga went on to sell approximately six million units.\r\n\r\nSecond generation Amiga systems (A1200 and A4000) were released in 1992. However, poor marketing and failure to repeat the technological advances of the first systems meant that the Amiga quickly lost its market share to competing platforms, such as the fourth generation game consoles, Apple Macintosh and IBM PC compatibles.",
    "youtube": "iUKKLzD4Pto",
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/boxart/4911-2.jpg",
    "emulators": []
  },
  {
    "id": "40",
    "name": "Commodore 64",
    "iconUrl": "https://picsum.photos/seed/c64/40/40",
    "emulators": [
      {
        "id": "vice-emu",
        "name": "VICE x64",
        "executablePath": "/usr/bin/vice",
        "args": "-fullscreen {ROM}"
      }
    ]
  },
  {
    "id": 2,
    "name": "Nintendo GameCube",
    "alias": "nintendo-gamecube",
    "icon": "nintendo-gamecube-1336524714.png",
    "console": "2.png",
    "controller": "2.png",
    "developer": "Nintendo",
    "manufacturer": "Nintendo",
    "media": "Disc",
    "cpu": "486 MHz IBM \"Gekko\" PowerPC CPU",
    "memory": "43 MB total non-unified RAM",
    "graphics": "162 MHz \"Flipper\" LSI (co-developed by Nintendo and ArtX, acquired by ATI)",
    "sound": "Dolby Pro Logic II",
    "maxcontrollers": "4",
    "display": "640×480 interlaced (480i) or progressive scan (480p) - 60 Hz",
    "overview": "The Nintendo GameCube was the first Nintendo console to use optical discs as its primary storage medium, after several aborted projects from Nintendo and its partners to utilize optical-based storage media.  In contrast with the GameCube's contemporary competitors, Sony's PlayStation 2, Sega's Dreamcast and Microsoft's Xbox, the GameCube uses miniDVD-based discs instead of full-size DVDs. Partially as a result of this, it does not have the DVD-Video playback functionality of these systems, nor the audio CD playback ability of other consoles that use full-size optical discs.\r\nIn addition, the GameCube introduced a variety of connectivity options to Nintendo consoles, and was the fourth Nintendo console, after the Nintendo 64DD, Famicom Modem and Satellaview, to support online play officially, via the Nintendo GameCube Broadband Adapter and Modem Adapter (sold separately). It also enabled connectivity to the Game Boy Advance to access exclusive features of certain games or to use the portable system as a controller for the Game Boy Player.",
    "youtube": null,
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/fanart/2-3.jpg",
    "emulators": []
  },
  {
    "id": 1,
    "name": "PC",
    "alias": "pc",
    "icon": "pc-1336524756.png",
    "console": "1.png",
    "controller": null,
    "developer": "IBM",
    "manufacturer": null,
    "media": null,
    "cpu": "x86 Based",
    "memory": null,
    "graphics": null,
    "sound": null,
    "maxcontrollers": null,
    "display": null,
    "overview": "PC stands for Personal Computer. Mass-market consumer computers use highly standardized components and so are simple for an end user to assemble into a working system. A typical desktop computer consists of a computer case which holds the power supply, motherboard, hard disk and often an optical disc drive. External devices such as a computer monitor or visual display unit, keyboard, and a pointing device are usually found in a personal computer.",
    "youtube": null,
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/fanart/1-1.jpg",
    "emulators": []
  },
  {
    "id": 4913,
    "name": "Sinclair ZX Spectrum",
    "alias": "sinclair-zx-spectrum",
    "icon": "sinclair-zx-spectrum-1393098451.png",
    "console": "4913.png",
    "controller": null,
    "developer": "Sinclair Research Ltd.",
    "manufacturer": "Sinclair Research Ltd.",
    "media": "Cassette tape",
    "cpu": "Zilog Z80A @ 3.5 MHz and equivalent",
    "memory": "16 kB / 48 kB / 128 kB",
    "graphics": "Text: 32 columns × 24 rows - 15 Shades | Image: 256×192 15 Shades",
    "sound": "1 Channel In-Built Beeper",
    "maxcontrollers": "Built In Rubber Keyboard / 1 Joystick Using Expansion Hardware",
    "display": "RF modulator",
    "overview": "The ZX Spectrum (pronounced \"Zed-Ex\") is an 8-bit personal home computer released in the United Kingdom in 1982 by Sinclair Research Ltd.\r\n\r\nReferred to during development as the ZX81 Colour and ZX82, the machine was launched as the ZX Spectrum by Sinclair to highlight the machine's colour display, compared with the black-and-white of its predecessor, the ZX81. The Spectrum was ultimately released as eight different models, ranging from the entry level model with 16 kB RAM released in 1982 to the ZX Spectrum +3 with 128 kB RAM and built in floppy disk drive in 1987; together they sold in excess of 5 million units worldwide (not counting numerous clones).\r\n\r\nThe Spectrum was among the first mainstream audience home computers in the UK, similar in significance to the Commodore 64 in the USA. The introduction of the ZX Spectrum led to a boom in companies producing software and hardware for the machine, the effects of which are still seen; some credit it as the machine which launched the UK IT industry. Licensing deals and clones followed, and earned Clive Sinclair a knighthood for \"services to British industry\".\r\n\r\nThe Commodore 64, BBC Microcomputer and later the Amstrad CPC range were major rivals to the Spectrum in the UK market during the early 1980s. Over 24,000 software titles have been released since the Spectrum's launch and new titles continue to be released, with over 90 new ones in 2010.",
    "youtube": "KJBR1BFH8V4",
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/fanart/4913-1.jpg",
    "emulators": []
  },
  {
    "id": 6,
    "name": "Super Nintendo (SNES)",
    "alias": "super-nintendo-snes",
    "icon": "super-nintendo-snes-1448530937.png",
    "console": "6.png",
    "controller": "6.png",
    "developer": "Nintendo",
    "manufacturer": "Nintendo",
    "media": "Cartridge",
    "cpu": "16-bit 65c816 Ricoh 5A22 3.58 MHz",
    "memory": "128kb",
    "graphics": null,
    "sound": "8-bit Sony SPC700",
    "maxcontrollers": "2",
    "display": "512 × 239",
    "overview": "The Super Nintendo Entertainment System (also known as the Super NES, SNES or Super Nintendo) is a 16-bit video game console that was released by Nintendo in North America, Europe, Australasia (Oceania), and South America between 1990 and 1993.\r\n\r\nIn Japan and Southeast Asia, the system is called the Super Famicom (officially adopting the abbreviated name of its predecessor, the Family Computer), or SFC for short. In South Korea, it is known as the Super Comboy and was distributed by Hyundai Electronics.\r\n\r\nAlthough each version is essentially the same, several forms of regional lockout prevent the different versions from being compatible with one another.\r\n\r\nThe Super Nintendo Entertainment System was Nintendo's second home console, following the Nintendo Entertainment System (NES). The console introduced advanced graphics and sound capabilities compared with other consoles at the time. Additionally, development of a variety of enhancement chips (which were integrated on game circuit boards) helped to keep it competitive in the marketplace.\r\n\r\nThe SNES was a global success, becoming the best-selling console of the 16-bit era despite its relatively late start and the fierce competition it faced in North America and Europe from Sega's Genesis console. \r\n\r\nThe SNES remained popular well into the 32-bit era, and although Nintendo no longer offers factory repairs/replacement or accessories for the console, it continues to be popular among fans, collectors, retro gamers, and emulation enthusiasts, some of whom are still making homebrew ROM images.",
    "youtube": "9fSAnVpJ42w",
    "userIconUrl": "https://cdn.thegamesdb.net/images/original/platform/fanart/6-2.jpg",
    "emulators": []
  }
]